In [1]:
import sqlite3
import pandas as pd

In [24]:
sqlite3.version

'2.6.0'

In [25]:
dir(sqlite3)

['Binary',
 'Cache',
 'Connection',
 'Cursor',
 'DataError',
 'DatabaseError',
 'Date',
 'DateFromTicks',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'OptimizedUnicode',
 'PARSE_COLNAMES',
 'PARSE_DECLTYPES',
 'PrepareProtocol',
 'ProgrammingError',
 'Row',
 'SQLITE_ALTER_TABLE',
 'SQLITE_ANALYZE',
 'SQLITE_ATTACH',
 'SQLITE_CREATE_INDEX',
 'SQLITE_CREATE_TABLE',
 'SQLITE_CREATE_TEMP_INDEX',
 'SQLITE_CREATE_TEMP_TABLE',
 'SQLITE_CREATE_TEMP_TRIGGER',
 'SQLITE_CREATE_TEMP_VIEW',
 'SQLITE_CREATE_TRIGGER',
 'SQLITE_CREATE_VIEW',
 'SQLITE_CREATE_VTABLE',
 'SQLITE_DELETE',
 'SQLITE_DENY',
 'SQLITE_DETACH',
 'SQLITE_DONE',
 'SQLITE_DROP_INDEX',
 'SQLITE_DROP_TABLE',
 'SQLITE_DROP_TEMP_INDEX',
 'SQLITE_DROP_TEMP_TABLE',
 'SQLITE_DROP_TEMP_TRIGGER',
 'SQLITE_DROP_TEMP_VIEW',
 'SQLITE_DROP_TRIGGER',
 'SQLITE_DROP_VIEW',
 'SQLITE_DROP_VTABLE',
 'SQLITE_FUNCTION',
 'SQLITE_IGNORE',
 'SQLITE_INSERT',
 'SQLITE_OK',
 'SQLITE_PRAGMA',
 'SQLITE_READ',
 'SQLITE_RECURSIVE',
 'SQLITE_REINDEX',
 'SQLITE_SAVEPOINT',
 'SQLITE_SELECT',
 'SQLITE_TRANSACTION',
 'SQLITE_UPDATE',
 'Statement',
 'Time',
 'TimeFromTicks',
 'Timestamp',
 'TimestampFromTicks',
 'Warning',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 'adapt',
 'adapters',
 'apilevel',
 'collections',
 'complete_statement',
 'connect',
 'converters',
 'datetime',
 'dbapi2',
 'enable_callback_tracebacks',
 'enable_shared_cache',
 'paramstyle',
 'register_adapter',
 'register_converter',
 'sqlite_version',
 'sqlite_version_info',
 'threadsafety',
 'time',
 'version',
 'version_info']

##
https://tariat.tistory.com/9

In [3]:
conn = sqlite3.connect("employee.db") 
cur = conn.cursor() 
conn.execute('CREATE TABLE employee_data(id INTEGER, name TEXT, nickname TEXT, department TEXT, employment_date TEXT)') 
cur.executemany( 'INSERT INTO employee_data VALUES (?, ?, ?, ?, ?)', 
                [(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000'), 
                 (2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000'), 
                 (2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000'), 
                 (1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000'), 
                 (1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000') ] ) 
conn.commit() 
conn.close()

In [7]:
conn = sqlite3.connect("employee.db")
cur = conn.cursor()

cur.execute('select * from employee_data')

In [8]:
rows = cur.fetchall() 
for row in rows: 
    print(row) 

conn.close()

(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000')
(2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000')
(2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000')
(1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000')
(1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000')

In [19]:
con = sqlite3.connect('employee.db')
cursor = con.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('employee_data',)]

In [9]:
import pandas as pd

In [40]:
df = pd.read_sql("select * from employee_data", con = sqlite3.connect("employee.db") )

In [41]:
df.head()

     id      name  nickname   department          employment_date
0  1001  Donghyun   SOMJANG  Development  2020-04-01 00:00:00.000
1  2001       Sol     Fairy    Marketing  2020-04-01 00:00:00.000
2  2002   Jiyoung  Magician    Marketing  2020-04-01 00:00:00.000
3  1002    Hyeona     Theif  Development  2020-04-01 00:00:00.000
4  1003   Soyoung     Chief  Development  2020-04-01 00:00:00.000

In [20]:
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", con = sqlite3.connect("employee.db") )

In [21]:
df

            name
0  employee_data

In [22]:
 pd.read_sql("SELECT name FROM sqlite_master ;", con = sqlite3.connect("employee.db") )

            name
0  employee_data

In [23]:
 pd.read_sql("SELECT * FROM sqlite_master ;", con = sqlite3.connect("employee.db") )

,type,name,tbl_name,rootpage,sql
0,table,employee_data,employee_data,2,"CREATE TABLE employee_data(id INTEGER, name TE..."

In [53]:
df.to_csv('data.csv', index=True)

In [54]:
df.columns

Index(['id', 'name'], dtype='object')

In [55]:
import csv, sqlite3

con = sqlite3.connect(":memory:")
cur = con.cursor()
cur.execute("CREATE TABLE t (id, name);") # use your column names here

with open('data.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['id'], i['name']) for i in dr]

cur.executemany("INSERT INTO t (id, name) VALUES (?, ?);", to_db)
con.commit()

df = pd.read_sql("select * from t", con = con )
print(df)
con.close()

     id      name
0  1001  Donghyun
1  2001       Sol
2  2002   Jiyoung
3  1002    Hyeona
4  1003   Soyoung

In [80]:
con = sqlite3.connect(":memory:")
cur = con.cursor()
cur.execute("CREATE TABLE t (id, name);") # use your column names here

dr = pd.read_csv("data.csv" )
to_db =  [ (i[1]['id'], i[1]['name']) for i in dr[['id','name']].iterrows()]

cur.executemany("INSERT INTO t (id, name) VALUES (?, ?);", to_db)
con.commit()

df = pd.read_sql("select * from t", con = con )
print(df)
con.close()

     id      name
0  1001  Donghyun
1  2001       Sol
2  2002   Jiyoung
3  1002    Hyeona
4  1003   Soyoung

In [78]:
 [ (i[1]['id'], i[1]['name']) for i in dr[['id','name']].iterrows()]

[(1001, 'Donghyun'),
 (2001, 'Sol'),
 (2002, 'Jiyoung'),
 (1002, 'Hyeona'),
 (1003, 'Soyoung')]